import { Interview } from "$/entity/interview/Interview";
import { ModeType } from "$/entity/lessons";
import { InterviewItem } from "$/entity/interview/InterviewItem";

export const htmlCssInterview = new Interview(ModeType.HTMLCSS_INTERVIEW, [
  new InterviewItem("Что такое HTML и для чего он используется?"),
  new InterviewItem("Какие теги используются для создания заголовков в HTML?"),
  new InterviewItem(
    "Каким образом можно создать ссылку на другую веб-страницу в HTML?"
  ),
  new InterviewItem(
    "Какие элементы можно использовать для создания списков в HTML?"
  ),
  new InterviewItem(
    "Как задать изображение на странице с помощью тега <img> в HTML?"
  ),
  new InterviewItem("Чем отличается блочный элемент от строчного в HTML?"),
  new InterviewItem(
    "Какие атрибуты можно использовать для задания внешнего вида элементов в CSS?"
  ),
  new InterviewItem("Каким способом можно задать стили в CSS?"),
  new InterviewItem("Что такое селектор в CSS?"),
  new InterviewItem("Как можно задать цвет фона элемента в CSS?"),
  new InterviewItem("Как задать стили для конкретного элемента в CSS?"),
  new InterviewItem(
    "Что такое псевдоклассы в CSS и для чего они используются?"
  ),
  new InterviewItem("Как можно задать границы для элемента в CSS?"),
  new InterviewItem("Как изменить шрифт текста с помощью CSS?"),
  new InterviewItem("Как создать анимацию с использованием CSS?"),
  new InterviewItem("Что такое Box Model в CSS и из каких частей он состоит?"),
  new InterviewItem("Что такое потоковая модель веб-страницы?"),
  new InterviewItem("Как создать горизонтальное меню навигации с помощью CSS?"),
  new InterviewItem(
    "Что такое отзывчивый дизайн (Responsive Design) и как его реализовать с помощью CSS?"
  ),
  new InterviewItem(
    "Как создать эффект при наведении курсора на элемент с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое псевдоэлементы в CSS и для чего они используются?"
  ),
  new InterviewItem("Как скрыть элемент на веб-странице с помощью CSS?"),
  new InterviewItem(
    "Как создать адаптивную сетку (Grid Layout) с помощью CSS?"
  ),
  new InterviewItem("Как установить шрифт с помощью CSS?"),
  new InterviewItem(
    "Каким образом можно выровнять элементы на веб-странице с помощью CSS?"
  ),
  new InterviewItem(
    "Как создать переход (transition) между состояниями элемента с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое псевдоклассы :hover, :active и :focus в CSS и для чего они используются?"
  ),
  new InterviewItem(
    "Как задать разные стили для разных состояний ссылки в CSS?"
  ),
  new InterviewItem(
    "Как создать анимацию ключевых кадров (keyframes) с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое flexbox и как его использовать для создания гибкого макета?"
  ),
  new InterviewItem(
    "Как создать медиазапросы (media queries) для адаптивного дизайна с помощью CSS?"
  ),
  new InterviewItem(
    "Как скрыть элемент на разных разрешениях экрана с помощью CSS?"
  ),
  new InterviewItem(
    "Каким образом можно установить фоновое изображение для элемента с помощью CSS?"
  ),
  new InterviewItem("Как создать анимацию плавающего элемента с помощью CSS?"),
  new InterviewItem(
    "Что такое псевдоэлемент ::before и ::after в CSS и для чего они используются?"
  ),
  new InterviewItem(
    "Каким образом можно выравнивать элементы по горизонтали и вертикали с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое приоритетность стилей в CSS и как она определяется?"
  ),
  new InterviewItem(
    "Каким образом можно применить CSS стили только для определенного устройства или браузера?"
  ),
  new InterviewItem("Что такое CSS препроцессоры и для чего они используются?"),
  new InterviewItem("Как создать выпадающее меню с помощью CSS?"),
  new InterviewItem(
    "Что такое проверка кросс-браузерности и как проверить, что веб-страница отображается корректно в разных браузерах?"
  ),
  new InterviewItem(
    "Как добавить анимацию плавного появления элемента с помощью CSS?"
  ),
  new InterviewItem(
    "Как изменить размер и расположение элемента при прокрутке страницы с помощью CSS?"
  ),
  new InterviewItem(
    "Каким образом можно применить стили к элементам, которые находятся внутри других элементов?"
  ),
  new InterviewItem(
    "Каким образом можно задать тень для элемента (box-shadow) в CSS?"
  ),
  new InterviewItem(
    "Каким образом можно создать анимацию циклического повторения в CSS?"
  ),
  new InterviewItem(
    "Что такое псевдоэлемент ::first-line в CSS и для чего он используется?"
  ),
  new InterviewItem(
    "Как изменить порядок отображения элементов на веб-странице с помощью CSS?"
  ),
  new InterviewItem(
    "Каким образом можно адаптировать веб-страницу для печати с помощью CSS?"
  ),
  new InterviewItem("Что такое градиенты (gradients) в CSS и как их создать?"),
  new InterviewItem(
    "Каким образом можно добавить иконку или символ веб-страницы с использованием CSS?"
  ),
  new InterviewItem(
    "Что такое плавающие элементы (float) в CSS и как они работают?"
  ),
  new InterviewItem("Как изменить положение фонового изображения в CSS?"),
  new InterviewItem(
    "Как задать прозрачность элемента (opacity) с помощью CSS?"
  ),
  new InterviewItem(
    "Каким способом можно создать эффект параллакса на веб-странице с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое CSS Grid и как его использовать для создания сетки веб-страницы?"
  ),
  new InterviewItem("Как изменить размер и форму элемента с помощью CSS?"),
  new InterviewItem(
    "Что такое медиа-запросы (media queries) и как использовать их для создания отзывчивого дизайна?"
  ),
  new InterviewItem(
    "Каким образом можно добавить анимацию появления элемента при прокрутке страницы с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое CSS-переменные (CSS variables) и какие преимущества они предоставляют?"
  ),
  new InterviewItem(
    "Как задать стили для элементов, которые находятся в определенных позициях внутри других элементов?"
  ),
  new InterviewItem(
    "Что такое CSS-in-JS и как он используется для стилизации компонентов?"
  ),
  new InterviewItem(
    "Как изменить расположение элемента на странице при разных разрешениях экрана с помощью CSS?"
  ),
  new InterviewItem(
    "Каким способом можно создать переключаемый (toggle) элемент или меню с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое миксины (mixins) в CSS препроцессорах и для чего они используются?"
  ),
  new InterviewItem(
    "Что такое плавающие элементы (float) в CSS и как они работают?"
  ),
  new InterviewItem("Как изменить положение фонового изображения в CSS?"),
  new InterviewItem(
    "Как задать прозрачность элемента (opacity) с помощью CSS?"
  ),
  new InterviewItem(
    "Каким способом можно создать эффект параллакса на веб-странице с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое CSS Grid и как его использовать для создания сетки веб-страницы?"
  ),
  new InterviewItem("Как изменить размер и форму элемента с помощью CSS?"),
  new InterviewItem(
    "Что такое медиа-запросы (media queries) и как использовать их для создания отзывчивого дизайна?"
  ),
  new InterviewItem(
    "Каким образом можно добавить анимацию появления элемента при прокрутке страницы с помощью CSS?"
  ),
  new InterviewItem(
    "Что такое CSS-переменные (CSS variables) и какие преимущества они предоставляют?"
  ),
  new InterviewItem(
    "Как задать стили для элементов, которые находятся в определенных позициях внутри других элементов?"
  ),
]);
